dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxHspdm_regdef.h
/** \brief Configuration Register */
typedef struct _Ifx_HSPDM_CON_Bits
{
    Ifx_UReg_32Bit EN0:1;             /**< \brief [0:0] Enable Bit Streaming Block BSB 0 - EN0 (rw) */
    Ifx_UReg_32Bit EN1:1;             /**< \brief [1:1] Enable Bit Streaming Block BSB 1 - EN1 (rw) */
    Ifx_UReg_32Bit SM:2;              /**< \brief [3:2] Streaming Mode: Direct Shifting or Sigma-Delta Mode - SM (rw) */
    Ifx_UReg_32Bit PAC:1;             /**< \brief [4:4] PAC enable or disable - PAC (rw) */
    Ifx_UReg_32Bit ITMDIV:2;          /**< \brief [6:5] ITM divider value - ITMDIV (rw) */
    Ifx_UReg_32Bit MM:1;              /**< \brief [7:7] Memory Mode - MM (rw) */
    Ifx_UReg_32Bit RUN:1;             /**< \brief [8:8] Run bit - RUN (rh) */
    Ifx_UReg_32Bit MPOL:1;            /**< \brief [9:9] Mute Polarity - MPOL (rw) */
    Ifx_UReg_32Bit ADCTGEN:1;         /**< \brief [10:10] ADC Trigger Block enable or disable - ADCTGEN (rw) */
    Ifx_UReg_32Bit DITH:3;            /**< \brief [13:11] Dither levels  - DITHER (rw) */
    Ifx_UReg_32Bit reserved_14:2;     /**< \brief [15:14] \internal Reserved */
    Ifx_UReg_32Bit RUNC:1;            /**< \brief [16:16] Run Bit Clear (w) */
    Ifx_UReg_32Bit RUNS:1;            /**< \brief [17:17] Run Bit Set (w) */
    Ifx_UReg_32Bit HREN:1;            /**< \brief [18:18] Hardware Run Signal Enable (rw) */
    Ifx_UReg_32Bit HRAE:1;            /**< \brief [19:19] Hardware Run Active Edge Selection (rw) */
    Ifx_UReg_32Bit HRSEL:1;           /**< \brief [20:20] Hardware Run Input Selection (rw) */
    Ifx_UReg_32Bit reserved_21:11;    /**< \brief [31:21] \internal Reserved */
} Ifx_HSPDM_CON_Bits;

/** \brief Current Address Register */
typedef struct _Ifx_HSPDM_CURRAD_Bits
{
    Ifx_UReg_32Bit CURRAD:13;         /**< \brief [12:0] Current Address in RAM - CURRADC (rh) */
    Ifx_UReg_32Bit reserved_13:19;    /**< \brief [31:13] \internal Reserved */
} Ifx_HSPDM_CURRAD_Bits;

/** \brief Flags Register */
typedef struct _Ifx_HSPDM_FLAGS_Bits
{
    Ifx_UReg_32Bit BAS:1;             /**< \brief [0:0] Buffer A Start Flag - BAS (rh) */
    Ifx_UReg_32Bit BAE:1;             /**< \brief [1:1] Buffer A End Flag - BAE (rh) */
    Ifx_UReg_32Bit BBS:1;             /**< \brief [2:2] Buffer B Start Flag - BBS (rh) */
    Ifx_UReg_32Bit BBE:1;             /**< \brief [3:3] Buffer B End Flag - BBE (rh) */
    Ifx_UReg_32Bit M0S:1;             /**< \brief [4:4] Mute 0 start flag - M0S (rh) */
    Ifx_UReg_32Bit M0E:1;             /**< \brief [5:5] Mute 0 end Flag - M0E (rh) */
    Ifx_UReg_32Bit M1S:1;             /**< \brief [6:6] Mute 1 start flag - M1S (rh) */
    Ifx_UReg_32Bit M1E:1;             /**< \brief [7:7] Mute 1 end flag - M1E (rh) */
    Ifx_UReg_32Bit ER:1;              /**< \brief [8:8] Error RAM Overflow - ER (rh) */
    Ifx_UReg_32Bit MUTE:1;            /**< \brief [9:9] Mute signal status - MUTE (rh) */
    Ifx_UReg_32Bit reserved_10:22;    /**< \brief [31:10] \internal Reserved */
} Ifx_HSPDM_FLAGS_Bits;

/** \brief Flags Clear Register */
typedef struct _Ifx_HSPDM_FLAGSCLEAR_Bits
{
    Ifx_UReg_32Bit BAS:1;             /**< \brief [0:0] Buffer A Start Flag, Clear Bit - BAS (w) */
    Ifx_UReg_32Bit BAE:1;             /**< \brief [1:1] Buffer A End Flag, Clear Bit - BAE (w) */
    Ifx_UReg_32Bit BBS:1;             /**< \brief [2:2] Buffer B Start Flag, Clear Bit - BBS (w) */
    Ifx_UReg_32Bit BBE:1;             /**< \brief [3:3] Buffer B End Flag, Clear Bit - BBE (w) */
    Ifx_UReg_32Bit M0S:1;             /**< \brief [4:4] Mute 0 Start Flag, Clear Bit - M0S (w) */
    Ifx_UReg_32Bit M0E:1;             /**< \brief [5:5] Mute 0 End Flag, Clear Bit - M0E (w) */
    Ifx_UReg_32Bit M1S:1;             /**< \brief [6:6] Mute 1 Start Flag, Clear Bit - M1S (w) */
    Ifx_UReg_32Bit M1E:1;             /**< \brief [7:7] Mute 1 End Flag, Clear Bit - M1E (w) */
    Ifx_UReg_32Bit ER:1;              /**< \brief [8:8] Error RAM Overflow, Clear Bit - ER (w) */
    Ifx_UReg_32Bit reserved_9:23;     /**< \brief [31:9] \internal Reserved */
} Ifx_HSPDM_FLAGSCLEAR_Bits;

/** \brief Flags Enable Register */
typedef struct _Ifx_HSPDM_FLAGSEN_Bits
{
    Ifx_UReg_32Bit BAS:1;             /**< \brief [0:0] Buffer A Start, Enable Bit - BAS (rw) */
    Ifx_UReg_32Bit BAE:1;             /**< \brief [1:1] Buffer A End, Enable Bit - BAE (rw) */
    Ifx_UReg_32Bit BBS:1;             /**< \brief [2:2] Buffer B Start, Enable Bit - BBS (rw) */
    Ifx_UReg_32Bit BBE:1;             /**< \brief [3:3] Buffer B End, Enable Bit - BBE (rw) */
    Ifx_UReg_32Bit M0S:1;             /**< \brief [4:4] Mute 0 Start, Enable Bit - M0S (rw) */
    Ifx_UReg_32Bit M0E:1;             /**< \brief [5:5] Mute 0 End, Enable Bit - M0E (rw) */
    Ifx_UReg_32Bit M1S:1;             /**< \brief [6:6] Mute 1 Start, Enable Bit - M1S (rw) */
    Ifx_UReg_32Bit M1E:1;             /**< \brief [7:7] Mute 1 End, Enable Bit - M1E (rw) */
    Ifx_UReg_32Bit ER:1;              /**< \brief [8:8] Error RAM Overflow, Enable Bit - ER (rw) */
    Ifx_UReg_32Bit reserved_9:23;     /**< \brief [31:9] \internal Reserved */
} Ifx_HSPDM_FLAGSEN_Bits;

/** \brief Flags Set Register */
typedef struct _Ifx_HSPDM_FLAGSSET_Bits
{
    Ifx_UReg_32Bit BAS:1;             /**< \brief [0:0] Buffer A Start Flag, Set Bit - BAS (w) */
    Ifx_UReg_32Bit BAE:1;             /**< \brief [1:1] Buffer A End Flag, Set Bit - BAE (w) */
    Ifx_UReg_32Bit BBS:1;             /**< \brief [2:2] Buffer B Start Flag, Set Bit - BBS (w) */
    Ifx_UReg_32Bit BBE:1;             /**< \brief [3:3] Buffer B End Flag, Set Bit - BBE (w) */
    Ifx_UReg_32Bit M0S:1;             /**< \brief [4:4] Mute 0 Start Flag, Set Bit - M0S (w) */
    Ifx_UReg_32Bit M0E:1;             /**< \brief [5:5] Mute 0 End Flag, Set Bit - M0E (w) */
    Ifx_UReg_32Bit M1S:1;             /**< \brief [6:6] Mute 1 Start Flag, Set Bit - M1S (w) */
    Ifx_UReg_32Bit M1E:1;             /**< \brief [7:7] Mute 1 End Flag, Set Bit - M1E (w) */
    Ifx_UReg_32Bit ER:1;              /**< \brief [8:8] Error RAM Overflow, Set Bit - ER (w) */
    Ifx_UReg_32Bit reserved_9:23;     /**< \brief [31:9] \internal Reserved */
} Ifx_HSPDM_FLAGSSET_Bits;

