dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxHspdm_regdef.h
/** \brief Flags Set Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_FLAGSSET_Bits B;        /**< \brief Bitfield access */
} Ifx_HSPDM_FLAGSSET;

/** \brief Module Identification Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_ID_Bits B;              /**< \brief Bitfield access */
} Ifx_HSPDM_ID;

/** \brief Kernel Reset Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_KRST0_Bits B;           /**< \brief Bitfield access */
} Ifx_HSPDM_KRST0;

/** \brief Kernel Reset Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_KRST1_Bits B;           /**< \brief Bitfield access */
} Ifx_HSPDM_KRST1;

/** \brief Kernel Reset Status Clear Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_KRSTCLR_Bits B;         /**< \brief Bitfield access */
} Ifx_HSPDM_KRSTCLR;

/** \brief MUTE0 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_MUTE0_Bits B;           /**< \brief Bitfield access */
} Ifx_HSPDM_MUTE0;

/** \brief MUTE1 Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_MUTE1_Bits B;           /**< \brief Bitfield access */
} Ifx_HSPDM_MUTE1;

/** \brief OCDS Control and Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_HSPDM_OCS_Bits B;             /**< \brief Bitfield access */
} Ifx_HSPDM_OCS;

/** \}  */

/******************************************************************************/
/** \addtogroup IfxSfr_Hspdm_Registers_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief HSPDM object */
typedef volatile struct _Ifx_HSPDM
{
       Ifx_UReg_32Bit                      SRAM[2048];            /**< \brief 0, SRAM*/
       Ifx_HSPDM_CLC                       CLC;                    /**< \brief 2000, Clock Control Register*/
       Ifx_UReg_8Bit                       reserved_2004[4];       /**< \brief 2004, \internal Reserved */
       Ifx_HSPDM_ID                        ID;                     /**< \brief 2008, Module Identification Register*/
       Ifx_UReg_8Bit                       reserved_200C[4];       /**< \brief 200C, \internal Reserved */
       Ifx_HSPDM_BUFA0                     BUFA0;                  /**< \brief 2010, RAM Buffer A Register 0*/
       Ifx_UReg_8Bit                       reserved_2014[4];       /**< \brief 2014, \internal Reserved */
       Ifx_HSPDM_BUFB0                     BUFB0;                  /**< \brief 2018, RAM Buffer B Register 0*/
       Ifx_HSPDM_CURRAD                    CURRAD;                 /**< \brief 201C, Current Address Register*/
       Ifx_HSPDM_MUTE0                     MUTE0;                  /**< \brief 2020, MUTE0 Register*/
       Ifx_HSPDM_MUTE1                     MUTE1;                  /**< \brief 2024, MUTE1 Register*/
       Ifx_UReg_8Bit                       reserved_2028[8];       /**< \brief 2028, \internal Reserved */
       Ifx_HSPDM_ADCTG                     ADCTG;                  /**< \brief 2030, ADC Trigger Register*/
       Ifx_HSPDM_ADCTGCNT                  ADCTGCNT;               /**< \brief 2034, ADC Trigger Count Register*/
       Ifx_HSPDM_CON                       CON;                    /**< \brief 2038, Configuration Register*/
       Ifx_UReg_8Bit                       reserved_203C[8];       /**< \brief 203C, \internal Reserved */
       Ifx_HSPDM_FLAGS                     FLAGS;                  /**< \brief 2044, Flags Register*/
       Ifx_HSPDM_FLAGSSET                  FLAGSSET;               /**< \brief 2048, Flags Set Register*/
       Ifx_HSPDM_FLAGSCLEAR                FLAGSCLEAR;             /**< \brief 204C, Flags Clear Register*/
       Ifx_HSPDM_FLAGSEN                   FLAGSEN;                /**< \brief 2050, Flags Enable Register*/
       Ifx_UReg_8Bit                       reserved_2054[148];     /**< \brief 2054, \internal Reserved */
       Ifx_HSPDM_OCS                       OCS;                    /**< \brief 20E8, OCDS Control and Status Register*/
       Ifx_HSPDM_KRSTCLR                   KRSTCLR;                /**< \brief 20EC, Kernel Reset Status Clear Register*/
       Ifx_HSPDM_KRST1                     KRST1;                  /**< \brief 20F0, Kernel Reset Register 1*/
       Ifx_HSPDM_KRST0                     KRST0;                  /**< \brief 20F4, Kernel Reset Register 0*/
       Ifx_HSPDM_ACCEN1                    ACCEN1;                 /**< \brief 20F8, Access Enable Register 1*/
       Ifx_HSPDM_ACCEN0                    ACCEN0;                 /**< \brief 20FC, Access Enable Register 0*/
} Ifx_HSPDM;

/** \}  */
/******************************************************************************/
/** \}  */


/******************************************************************************/

/******************************************************************************/

#endif /* IFXHSPDM_REGDEF_H */
